УТ_для_edt.РасширениеСмарт/src/Documents/ПоручениеЭкспедитору/ПоручениеЭкспедитору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3af4c44b-ede1-426e-a9e9-ab54b705bbcd">
  <name>ПоручениеЭкспедитору</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5d20c737-5039-4cee-a650-bca499bbc637">
    <name>смартСамовывозСоСкладаАдмирал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ecbfed88-7ed7-45eb-a8d5-8c11f88fbc12">
    <name>ПоручениеЭкспедиторуНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="64858d0d-3081-4b86-946a-23810f59eebc">
    <name>ПоручениеЭкспедиторуСоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="266e90f6-450a-4536-8666-1cbbb3eedb6c">
    <name>ПоручениеЭкспедиторуВПункте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4aa81cd-18f1-4902-9c1f-c902893806b3">
    <name>смартГенеральныйДиректор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="766ca5a6-8585-4744-82ef-ceeb65521cb2">
    <name>смартБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47683048-9c72-4bdd-96b5-bc2b6dcad26a">
    <name>смартОтветственныйЗаЭДО</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cfd754c-c822-4e79-b5ab-2ee7ff24fb99">
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a7affe-e81a-4e16-9597-b677a73ec63f">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d433a349-afcf-447e-ae95-310605a8cb7a">
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/ПоручениеЭкспедитору/Forms/ФормаДокумента/Module.bsl
//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		Объект.ДатаВыполнения = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	#Вставка
	//смарт+ Вахов Владимир /467 / 22.03.2021 
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада Тогда

		ДобавляемыеРеквизиты	= Новый Массив;

		Реквизит_смартОбразцы = Новый РеквизитФормы("смартОбразцы",	Новый ОписаниеТипов("Булево"));
		Реквизит_смартКонтрагент = Новый РеквизитФормы("смартКонтрагент",	Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Реквизит_смартОрганизация = Новый РеквизитФормы("смартОрганизация",	Новый ОписаниеТипов("СправочникСсылка.Организации"));

		ДобавляемыеРеквизиты.Добавить(Реквизит_смартОбразцы);
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

		НовыйЭлементОбразцы = Элементы.Добавить("смартОбразцы", Тип("ПолеФормы"));
		НовыйЭлементОбразцы.ПутьКДанным                  = "Объект.смартОбразцы";
		НовыйЭлементОбразцы.Вид                          = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементОбразцы.УстановитьДействие("ПриИзменении", "Подключаемый_смартОбразцыПриИзменении");

		НовыйЭлементКонтрагент = Элементы.Добавить("смартКонтрагент", Тип("ПолеФормы"), Элементы.ГруппаПунктЗона);
		НовыйЭлементКонтрагент.ПутьКДанным                  = "Объект.смартКонтрагент";
		НовыйЭлементКонтрагент.Вид                          = ВидПоляФормы.ПолеВвода;
		НовыйЭлементКонтрагент.Видимость = Объект.смартОбразцы;
		НовыйЭлементКонтрагент.АвтоОтметкаНезаполненного = Истина;
		НовыйЭлементКонтрагент.УстановитьДействие("ПриИзменении", "Подключаемый_смартКонтрагентПриИзменении");

		НовыйЭлементОрганизация = Элементы.Добавить("смартОрганизация", Тип("ПолеФормы"), Элементы.ГруппаСклад);
		НовыйЭлементОрганизация.ПутьКДанным                  = "Объект.смартОрганизация";
		НовыйЭлементОрганизация.Вид                          = ВидПоляФормы.ПолеВвода;
		НовыйЭлементОрганизация.Видимость = Объект.смартОбразцы;
		НовыйЭлементОрганизация.АвтоОтметкаНезаполненного = Истина;

		Элементы.Переместить(НовыйЭлементОбразцы, ЭтаФорма, Элементы.ЗаголовокОткуда);

		ДобавитьАдресаКонтрагента();

	КонецЕсли;
	//смарт- Вахов Владимир /467 / 22.03.2021
    #КонецВставки

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
&НаСервере
&ИзменениеИКонтроль("ПунктПриИзмененииНаСервере")
Процедура смарт_ПунктПриИзмененииНаСервере()

	Элементы.АдресПункта.СписокВыбора.Очистить();
	ПустыеРеквизиты = ДоставкаТоваровКлиентСервер.ПолучитьПустуюСтруктуруРеквизитовДоставки(Объект);
	ЗаполнитьЗначенияСвойств(Объект, ПустыеРеквизиты,,"СпособДоставки,ДополнительнаяИнформацияПоДоставке");

	Если ЗначениеЗаполнено(Объект.Пункт) Тогда

		ДоставкаТоваров.ЗаполнитьСпискиВыбораАдресовПолучателяОтправителя(Элементы, Объект);
		Если Элементы.АдресПункта.СписокВыбора.Количество() > 0 Тогда
			ПерваяСтруктураВСписке = Элементы.АдресПункта.СписокВыбора[0].Значение;

			Если ДоставкаТоваровКлиентСервер.ДопИнфоИзмененоПользователем(Элементы, Объект) Тогда
				ЗаполнитьЗначенияСвойств(Объект, ПерваяСтруктураВСписке,
				"АдресДоставки, АдресДоставкиЗначенияПолей, ЗонаДоставки, ВремяДоставкиС, ВремяДоставкиПо");
			Иначе
				ЗаполнитьЗначенияСвойств(Объект, ПерваяСтруктураВСписке);
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ПроверитьЗаполнитьКонтактноеЛицо();

	УстановитьДоступностьЭлементов();
	
	#Вставка
	//смарт+ Вахов Владимир /467 / 24.03.2021   
	Объект.смартКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	//смарт- Вахов Владимир /467 / 24.03.2021	
    #КонецВставки
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024


//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
&НаСервере
&ИзменениеИКонтроль("СпособДоставкиПриИзмененииНаСервере")
Процедура смарт_СпособДоставкиПриИзмененииНаСервере()

	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада Тогда
		Элементы.ЗаголовокОткуда.Видимость = Истина;
		Элементы.ОтступОткуда.Видимость    = Истина;
		Элементы.Склад.Видимость           = Истина;
		Элементы.ЗаголовокСклад.Видимость  = Истина;
		Элементы.ЗаголовокОткуда.Заголовок = НСтр("ru = 'Откуда'");
		Элементы.ЗаголовокКуда.Заголовок   = НСтр("ru = 'Куда'");
	ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад Тогда
		Элементы.ЗаголовокОткуда.Видимость = Истина;
		Элементы.ОтступОткуда.Видимость    = Истина;
		Элементы.Склад.Видимость           = Истина;
		Элементы.ЗаголовокСклад.Видимость  = Истина;
		Элементы.ЗаголовокОткуда.Заголовок = НСтр("ru = 'Куда'");
		Элементы.ЗаголовокКуда.Заголовок   = НСтр("ru = 'Откуда'");
	Иначе
		Элементы.ЗаголовокОткуда.Видимость = Ложь;
		Элементы.ОтступОткуда.Видимость    = Ложь;
		Элементы.Склад.Видимость           = Ложь;
		Элементы.ЗаголовокСклад.Видимость  = Ложь;
		Элементы.ЗаголовокКуда.Заголовок   = НСтр("ru = 'Где'");
	КонецЕсли;

	#вставка
	//смарт+ Вахов Владимир /467 / 24.03.2021   
	ОтображениеРеквизитовОбразец();
	//смарт- Вахов Владимир /467 / 24.03.2021
    #КонецВставки
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021   
&НаКлиенте
Процедура Подключаемый_смартОбразцыПриИзменении(Элемент)
	
	ЭлементКонтрагент = Элементы.Найти("смартКонтрагент");
	
	Если ЭлементКонтрагент <> Неопределено Тогда
		ЭлементКонтрагент.Видимость = Объект.смартОбразцы;		
	КонецЕсли;	
	
	ЭлементОрганизация = Элементы.Найти("смартОрганизация");
	
	Если ЭлементОрганизация <> Неопределено Тогда
		ЭлементОрганизация.Видимость = Объект.смартОбразцы;		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаКлиенте
Процедура Подключаемый_смартКонтрагентПриИзменении(Элемент)
	
	ДобавитьАдресаКонтрагента();
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаСервере
Процедура ДобавитьАдресаКонтрагента()
	
	АдресаИзКонтактнойИнформации = АдресаИзКонтактнойИнформации(Объект.смартКонтрагент);
	
	Для Каждого Стр Из АдресаИзКонтактнойИнформации Цикл
		
		НайденныйЭлемент = ДоставкаТоваровКлиентСервер.НайтиВСпискеСтруктур(Элементы.АдресПункта.СписокВыбора,"АдресДоставки",Стр.АдресДоставки);
		
		Если НайденныйЭлемент = Неопределено Тогда
			СтруктураВыбора = СтруктураВыбора();
			ЗаполнитьЗначенияСвойств(СтруктураВыбора, Стр);
			Элементы.АдресПункта.СписокВыбора.Добавить(СтруктураВыбора, Стр.Вид + ": " + Стр.АдресДоставки);
		Иначе
			ДозаполнитьПустыеСвойства(НайденныйЭлемент.Значение, Стр);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаСервереБезКонтекста
Функция СтруктураВыбора()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("АдресДоставки", "");
	СтруктураВыбора.Вставить("АдресДоставкиЗначенияПолей", "");
	СтруктураВыбора.Вставить("ЗонаДоставки", Справочники.ЗоныДоставки.ПустаяСсылка());
	СтруктураВыбора.Вставить("ВремяДоставкиС", Дата(1,1,1));
	СтруктураВыбора.Вставить("ВремяДоставкиПо", Дата(1,1,1));
	СтруктураВыбора.Вставить("ДополнительнаяИнформацияПоДоставке", "");
	
	Возврат СтруктураВыбора;
	
КонецФункции //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаСервереБезКонтекста
Функция АдресаИзКонтактнойИнформации(ПолучательОтправитель)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресДоставки,
	|	КонтактнаяИнформация.Вид.Представление КАК Вид,
	|	КонтактнаяИнформация.ЗначенияПолей КАК АдресДоставкиЗначенияПолей
	|ИЗ
	|	Справочник." + ПолучательОтправитель.Метаданные().Имя + ".КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &ПолучательОтправитель
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
	
	Запрос.УстановитьПараметр("ПолучательОтправитель", ПолучательОтправитель);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаСервереБезКонтекста
Процедура ДозаполнитьПустыеСвойства(СтруктураПриемник, Источник)
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Элемент Из СтруктураПриемник Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтруктураЗаполнения.Вставить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Источник);
	ЗаполнитьЗначенияСвойств(СтруктураПриемник, СтруктураЗаполнения);
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024

//++ #Б-982 смарт: Мосолов 02.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПоручениеЭкспедитору
//смарт+ Вахов Владимир /467 / 22.03.2021
&НаСервере
Процедура ОтображениеРеквизитовОбразец()
	
	ЭлементОбразцы = Элементы.Найти("смартОбразцы");
	ЭлементКонтрагент = Элементы.Найти("смартКонтрагент");
	ЭлементОрганизация = Элементы.Найти("смартОрганизация");
	
	Если ЭлементОбразцы <> Неопределено
		И ЭлементКонтрагент <> Неопределено
		И ЭлементОрганизация <> Неопределено Тогда
		
		Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада Тогда
			
			ЭлементОбразцы.Видимость = Истина;
			ЭлементКонтрагент.Видимость = Истина;
			ЭлементОрганизация.Видимость = Истина;
			
		ИначеЕсли Объект.СпособДоставки = Перечисления.СпособыДоставки.ПоручениеЭкспедиторуНаСклад Тогда
			
			ЭлементОбразцы.Видимость = Ложь;
			ЭлементКонтрагент.Видимость = Ложь;
			ЭлементОрганизация.Видимость = Ложь;
			
		Иначе
			
			ЭлементОбразцы.Видимость = Ложь;
			ЭлементКонтрагент.Видимость = Ложь;
			ЭлементОрганизация.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #Б-982 смарт: Мосолов 02.10.2024
